#include <iostream>
#include "set.h"

//Описать класс «Множество». Класс должен реализовывать следующие возможности:

//     элементом множества может быть другое множество;
//     проверка на пустое множество;
//     добавление элемента;
//     удаление элемента;
//     определение мощности множества;
//     проверка принадлежности элемента множеству ([]);
//     объединение двух множеств (+, +=);
//     пересечение двух множеств (*, *=);
//     разность двух множеств (-, -=);
//     построение булеана (множества всех подмножеств) данного множества.

// Описать класс «Неориентированное канторовское множество» (элементы не повторяются и не упорядочены). Класс должен дополнительно реализовывать формирование множества из строки (например, {a, b, c, {a, b}, {}, {a, {c}}}).

bool CSet::Is_empty()const{
    return ;
}
bool CSet::Does_belong()const{};
void CSet::Clear(){}
int CSet::Det_cardinality()const{}
void CSet::Rmv_el(){}

CSet CSet::Unite(CSet& b)const{}
CSet CSet::Intersect(CSet& b)const{}
CSet CSet::Substract(CSet& b)const{}
CSet CSet::Construct_PwrSet()const{}

int main(){

    return 0;
}